<a href="https://colab.research.google.com/github/hkolgur/UOH/blob/main/pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive 
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# Pandas and DataFrames

#### NewYork Weather data

In [ ]:
import pandas as pd

df=pd.read_csv("nyc_weather.csv")
df.head()

        EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
0  1/1/2016           38        23  ...           5     NaN             281
1  1/2/2016           36        18  ...           3     NaN             275
2  1/3/2016           40        21  ...           1     NaN             277
3  1/4/2016           25         9  ...           3     NaN             345
4  1/5/2016           20        -3  ...           0     NaN             333

[5 rows x 11 columns]

In [ ]:
#Get Maximum Temperature
df['Temperature'].max()

50

In [ ]:
#which day does it rain and how many days does it rain.
#print(df[df['Events']=='Rain']['EST'])
print(df['EST'][df['Events']=='Rain'])
print(len(df[df['Events']=='Rain']))

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object
4

In [ ]:
#Average wind speed
df['WindSpeedMPH'].mean()

6.892857142857143

In [ ]:
df1=pd.read_csv("weather_data.csv")
df1.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

## Construct a DataFrame Manually sample 2 records

In [ ]:
data=[('1/1/2017',32,6,'Rain'),('1/2/2017',35,7,'Sunny')] #Data is : list of tupples separated by comma , 
df2=pd.DataFrame(data,columns=['day','temperature','windspeed','event'])
df2.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [ ]:
df1.shape # shape of datafreme rows and columns
df1[3:5]  #slicing to access data
df1.columns # list all the column names of DF
df1.day      # Access a particular column
df1['day']   # Access a particular column
df1[['day','temperature']] # Access multiple columns
df1['temperature'].describe() # Gives count,min,max,std,percentiles

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [ ]:
#Day with maximum temperature
#df1['day']['temperature==df1['temperature'].max()]
df1[df1['temperature']==df1['temperature'].max()]['day']

1    1/2/2017
Name: day, dtype: object

In [ ]:
#df1.to_csv("filename.csv",index=False) this will store data and index will not be stored 
#to store in xlsx df1.to_exvel('new.xlsx',sheetname='sheet1') -->need to install pip3 openpyx

In [ ]:
df2=pd.read_csv("weather_data_cities.csv")
df2.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

## Display contents of a gorupby

In [ ]:
g=df2.groupby(['city'])
for city,city_df in g:
  print(city)
  print(city_df)
print("---------------------")
print(g.get_group('mumbai'))
print("---------------------")
print(g.max(),g.mean())

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy
---------------------
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
---------------------
               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny           temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
print("---------------------")
print(g.describe())

---------------------
         temperature                         ... windspeed
               count   mean       std   min  ...       25%   50%    75%   max
city                                         ...
mumbai           4.0  88.50  3.109126  85.0  ...      5.00   8.5  12.75  15.0
new york         4.0  32.25  3.304038  28.0  ...      6.75   7.0   8.25  12.0
paris            4.0  47.75  5.315073  42.0  ...      9.50  11.5  14.75  20.0

[3 rows x 16 columns]

## Concatinate Data Frames

In [ ]:
df_US=pd.DataFrame({"City":['Chicago','SFO','NewYork'],
        "awards":[1,2,3]
        })
df_Asia=pd.DataFrame({"City":['Delhi','Tokyo','Bejing'],
          "awards":[10,9,8]})
df_US_playercount=pd.DataFrame({"City":['Chicago','SFO','NewYork'],
        "PlayerNames":["Alpha","Beta","Gama"]
        })
df_Asia_playercount=pd.DataFrame({"City":['Tokyo','Bejing'],
          "PlayerName":["DEF","XYZ"]})

In [ ]:
df_all=pd.concat([df_Asia,df_US],ignore_index=True) #This will concat rowwise and copy indices form each data frame hence use ignore_index=True
df_all.head()

      City  awards
0    Delhi      10
1    Tokyo       9
2   Bejing       8
3  Chicago       1
4      SFO       2

In [ ]:
df_all_colum_wise=pd.concat([df_Asia,df_US],axis=1) #concat column wise
df_all_colum_wise.head()

     City  awards     City  awards
0   Delhi      10  Chicago       1
1   Tokyo       9      SFO       2
2  Bejing       8  NewYork       3

## Merge Data frames on Key

In [ ]:
Final=pd.merge(df_Asia_playercount,df_Asia,on='City') # This will not dipaly data of Delhi as its not present in one DF 
Final.head()

     City PlayerName  awards
0   Tokyo        DEF       9
1  Bejing        XYZ       8

In [ ]:
Final=pd.merge(df_Asia_playercount,df_Asia,on='City',how='outer') # This will diaply Delhi player putting a NAN and list awards
Final.head()

     City PlayerName  awards
0   Tokyo        DEF       9
1  Bejing        XYZ       8
2   Delhi        NaN      10

## loc vs iloc location vs index location

In [2]:
import pandas as pd
df3=pd.DataFrame(['A','B','C'],index=[80,90,100])
print(df3.head())
print("---------------------")
print(df3.loc[100])           #for loc pass the actual index value of the item to access
print("---------------------")
print(df3.iloc[2])          #for iloc pass the row number 
print("---------------------")
print(df3.loc[:100])        #get all the rows until you get the index value of 100
print("---------------------")
print(df3.iloc[:2])        #get index locations up to 2

     0
80   A
90   B
100  C
---------------------
0    C
Name: 100, dtype: object
---------------------
0    C
Name: 100, dtype: object
---------------------
     0
80   A
90   B
100  C
---------------------
    0
80  A
90  B

In [5]:
# what will be the output if you use loc and give a value that is in between 2 values of loc?
df3.loc[:95] #It will display upto the value that is matched . Though 95 is not present, it will display all rows that has loc values <=95

    0
80  A
90  B

In [6]:
df3.loc[:100000] #this is also valid it will show all values less thatn 10k

     0
80   A
90   B
100  C